package graph.topoSort;

/**
 * https://www.hzxueyan.com/archives/104/
 * 由于无敌的凡凡在 2005 年世界英俊帅气男总决选中胜出，Yali Company 总经理 Mr.Z 心情好，决定给每位员工发奖金。
 * 公司决定以每个人本年在公司的贡献为标准来计算他们得到奖金的多少。
 * 于是 Mr.Z 下令召开 m 方会谈。
 * 每位参加会谈的代表提出了自己的意见：“我认为员工 a 的奖金应该比 b高！”
 * Mr.Z 决定要找出一种奖金方案，满足各位代表的意见，且同时使得总奖金数最少。
 * 每位员工奖金最少为 100 元，且必须是整数。
 * 输入
 * 第一行包含整数 n, m分别表示公司内员工数以及参会代表数。
 * 接下来 m 行，每行 2 个整数 a,b，表示某个代表认为第 a 号员工奖金应该比第 b号员工高。
 * 输出
 * 若无法找到合理方案，则输出Poor Xed；
 * 否则输出一个数表示最少总奖金。
 * 数据范围
 * 1≤n≤10000
 *  1≤m≤20000
 * 输入样例
 * 2 1
 * 1 2
 * 输出样例
 * 201
 */
public class 奖金 {
    public static void main(String[] args) {

    }
}
